base/Enums/бит_ЭлементыГрафическойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ЭлементыГрафическойСхемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
					<Comment>Старт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
					<Comment>Действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
					<Comment>Разделение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
					<Comment>Слияние</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/CommonModules/бит_ГрафическиеСхемы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры/функции работы с графическими схемами.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Конструктор параметров размеров и отступов для элементов графической схемы.
//
// Параметры:
//  ДлинаЯчейки - Число. Для ячейки, относительно которой рассчитываются пропорции (по умолчанию 20 пикселей)
//
// Возвращаемое значение:
//  Структура.
//
Функция НовыеПараметрыРазмещенияЭлементовСхемы(ДлинаЯчейки = 20) Экспорт
	
	ПараметрыРазмещения = Новый Структура;
	ПараметрыРазмещения.Вставить("ВерхнееПоле",                ДлинаЯчейки);
	ПараметрыРазмещения.Вставить("ЛевоеПоле",                  ДлинаЯчейки);
	ПараметрыРазмещения.Вставить("ГоризонитальныйРазделитель", ДлинаЯчейки * 2);
	ПараметрыРазмещения.Вставить("ВертикальныйРазделитель",    ДлинаЯчейки * 2);
	ПараметрыРазмещения.Вставить("ШиринаЭлемента",             ДлинаЯчейки * 6);
	ПараметрыРазмещения.Вставить("ВысотаЭлемента",             ДлинаЯчейки * 3);
	ПараметрыРазмещения.Вставить("Бардюры",                    ДлинаЯчейки / 4);
	ПараметрыРазмещения.Вставить("СмещениеВерхнихРядов",       0);
	ПараметрыРазмещения.Вставить("МенятьГраниСоединенияЛиний", Истина);
	ПараметрыРазмещения.Вставить("ПроверятьПересечениеЛинийСЭлементами", Ложь);
	
	Возврат ПараметрыРазмещения;
	
КонецФункции

// Конструктор таблицы связий линий соединения элементов графической схемы.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция НоваяТаблицаСвязейЭлементовГрафическойСхемы() Экспорт
	
	ОписаниеТипаИндекса = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(0, 0, ДопустимыйЗнак.Любой));
	
	ТаблицаСвязей = Новый ТаблицаЗначений;
	ТаблицаСвязей.Колонки.Добавить("ЛинияСвязи",      ОписаниеТипаИндекса);
	ТаблицаСвязей.Колонки.Добавить("ЭлементИсточник", ОписаниеТипаИндекса);
	ТаблицаСвязей.Колонки.Добавить("ГраньИсточника",  ОписаниеТипаИндекса);
	ТаблицаСвязей.Колонки.Добавить("ЭлементПриемник", ОписаниеТипаИндекса);
	ТаблицаСвязей.Колонки.Добавить("ГраньПриемника",  ОписаниеТипаИндекса);
	ТаблицаСвязей.Колонки.Добавить("Заголовок",       Новый ОписаниеТипов("Строка", ,
													  Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаСвязей.Индексы.Добавить("ЭлементИсточник");
	
	Возврат ТаблицаСвязей;
	
КонецФункции

// Создает новый элемент графической схемы XDTO.
//
// Параметры:
//  ВидЭлемента - ПеречислениеСсылка.бит_ЭлементыГрафическойСхемы.
//	Индекс - Число. Индекс создаваемого элемента.
//	Наименование - Строка.
//
// Возвращаемое значение:
//  ЭлементСхемыXDTO.
//
Функция НовыйЭлементСхемы(ВидЭлемента, Индекс, Наименование = "") Экспорт
	
	ИндексВидаЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Индекс(ВидЭлемента);
	МетаданныеЭлемента = Метаданные.Перечисления.бит_ЭлементыГрафическойСхемы.ЗначенияПеречисления[ИндексВидаЭлемента];
	
	НовыйЭлемент = СериализаторXDTO.Фабрика.Создать(
					СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.2/data/graphscheme","GraphSchemeItem"));
	НовыйЭлемент.itemType = ИндексВидаЭлемента;
	КодЭлемента           = МетаданныеЭлемента.Имя;
	НаименованиеЭлемента  = МетаданныеЭлемента.Синоним;
	
	НовыйЭлемент.itemCode     = КодЭлемента + Формат(Индекс, "ЧГ=");
	НовыйЭлемент.itemId       = Индекс;
	НовыйЭлемент.itemTabOrder = Индекс;
	
	НовыйЭлемент.backColor = Новый Цвет;
	НовыйЭлемент.lineColor = ЦветаСтиля.ЦветРамки;
	НовыйЭлемент.Border    = СериализаторXDTO.ЗаписатьXDTO(Новый Линия(ТипСоединительнойЛинии.Сплошная,1));
	
	НовыйЭлемент.alignHor  = ГоризонтальноеПоложение.Центр;
	НовыйЭлемент.alignVer  = ВертикальноеПоложение.Центр;
	
	ТекстЗаголовка = "";
	Если НаименованиеЭлемента = "Линия" Тогда
		НовыйЭлемент.decorativeLine       = Ложь;
		НовыйЭлемент.beginArrowStyle      = СтильСтрелки.Нет;
		НовыйЭлемент.endArrowStyle        = СтильСтрелки.Заполненная;
		НовыйЭлемент.connectFromPortIndex = 0;
		Если НЕ ПустаяСтрока(Наименование) Тогда
			ТекстЗаголовка = Наименование;
			
			НовыйЭлемент.textPos = ПоложениеТекстаСоединительнойЛинии.СерединаЛинии;
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(Наименование) Тогда
			ТекстЗаголовка = НаименованиеЭлемента + Формат(Индекс, "ЧГ=");
		Иначе
			ТекстЗаголовка = Наименование;
		КонецЕсли;
	КонецЕсли;
	
	НовыйЭлемент.itemTitle = НовыйОбъектСтрокаXDTO(ТекстЗаголовка);
	НовыйЭлемент.currentLanguage = "#";
	
	Возврат НовыйЭлемент;
	
КонецФункции

// Определяет границы размещения элемента графической схемы.
//
// Параметры:
//  ПараметрыРазмещения - Структура. Параметры пропорций: см. НовыеПараметрыРазмещенияЭлементовСхемы()
//	НомерСтроки  - Число.
//	НомерКолонки - Число.
//
// Возвращаемое значение:
//  Структура.
//
Функция ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, НомерСтроки = 1, НомерКолонки = 1) Экспорт
	
	Границы = Новый Структура;
	
	rectLeft   = ПараметрыРазмещения.ЛевоеПоле
					+ (НомерКолонки - 1)
					* (ПараметрыРазмещения.ШиринаЭлемента + ПараметрыРазмещения.ГоризонитальныйРазделитель);
	rectRight  = rectLeft + ПараметрыРазмещения.ШиринаЭлемента;
	rectTop    = ПараметрыРазмещения.ВерхнееПоле
					+ (НомерСтроки - 1)
					* (ПараметрыРазмещения.ВысотаЭлемента + ПараметрыРазмещения.ВертикальныйРазделитель)
					+ ПараметрыРазмещения.СмещениеВерхнихРядов;
	rectBottom = rectTop + ПараметрыРазмещения.ВысотаЭлемента;
	
	Границы.Вставить("rectLeft",   rectLeft);
	Границы.Вставить("rectRight",  rectRight);
	Границы.Вставить("rectTop",    rectTop);
	Границы.Вставить("rectBottom", rectBottom);
	
	Возврат Границы;
	
КонецФункции

// Устанавливает вершины элементов на графической схеме.
//
// Параметры:
//  ТочкаXDTO - XDTO:KeyAndValue. Элемент схемы XDTO.
//  ГраницыЭлемента - Структура.
//  ПараметрыРазмещения - Структура.
//
Процедура РазместитьЭлементНаСхеме(ТочкаXDTO, ГраницыЭлемента, ПараметрыРазмещения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ТочкаXDTO, ГраницыЭлемента);
	
	ТипЭлемента = ТипЭлементаXDTOГрафическойСхемы(ТочкаXDTO);
	КоординатыВершин = ТочкаXDTO.point;
	КоординатыВершин.Очистить();
	
	Координаты = НовыеКоординатыЭлементаXDTO();
	
	Если ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Старт Тогда
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = ГраницыЭлемента.rectTop + ПараметрыРазмещения.Бардюры;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft + (ПараметрыРазмещения.ШиринаЭлемента / 2);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = ГраницыЭлемента.rectTop + ПараметрыРазмещения.Бардюры;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	ИначеЕсли ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Разделение Тогда
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft + (ПараметрыРазмещения.ШиринаЭлемента / 2);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	ИначеЕсли ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Слияние Тогда
		Координаты.x = ГраницыЭлемента.rectLeft + (ПараметрыРазмещения.ШиринаЭлемента / 2);
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	ИначеЕсли ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Завершение Тогда
		Координаты.x = ГраницыЭлемента.rectLeft + (ПараметрыРазмещения.ШиринаЭлемента / 2);
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1) - ПараметрыРазмещения.Бардюры;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1) - ПараметрыРазмещения.Бардюры;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	ИначеЕсли ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Условие Тогда
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = ГраницыЭлемента.rectTop + (ПараметрыРазмещения.ВысотаЭлемента / 2);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft + ПараметрыРазмещения.Бардюры;
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectRight - ПараметрыРазмещения.Бардюры;
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = ГраницыЭлемента.rectTop + (ПараметрыРазмещения.ВысотаЭлемента / 2);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectRight - ПараметрыРазмещения.Бардюры;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft + ПараметрыРазмещения.Бардюры;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	Иначе
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = ГраницыЭлемента.rectTop;
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = (ГраницыЭлемента.rectRight - 1);
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
		
		Координаты.x = ГраницыЭлемента.rectLeft;
		Координаты.y = (ГраницыЭлемента.rectBottom - 1);
		КоординатыВершин.Добавить(НоваяТочкаXDTO(Координаты));
	КонецЕсли;
	
КонецПроцедуры

// Указывает связи источников и приемников соединительной линии.
//
// Параметры:
//	Линия 		   - ЭлментXDTO. Соединительная линия.
//	ТаблицаСвязей  - ТаблицаЗначений. Таблица связей элементов схемы: см. НоваяТаблицаСвязейЭлементовГрафическойСхемы().
//  Источник 	   - ЭлментXDTO. Элемент исходящей связи.
//  Приемник 	   - ЭлментXDTO. Элемент входящией связи.
//  ГраньИсточника - Число (По умолчанию = 4).
//
Процедура УстановитьПривязкуСоединительнойЛинии(Линия, ТаблицаСвязей, Источник, Приемник = Неопределено, ГраньИсточника = 4) Экспорт
	
	Линия.connectFromItemId = Источник.itemId;
	Линия.portIndexFrom     = ГраньИсточника;
	Если Приемник = Неопределено Тогда
		Линия.connectToItemId = -1;
		Линия.portIndexTo     = 0;
	Иначе
		Линия.connectToItemId = Приемник.itemId;
		Линия.portIndexTo     = 2;
	КонецЕсли;
	
	НоваяСвязь = ТаблицаСвязей.Добавить();
	НоваяСвязь.ЛинияСвязи      = Линия.itemId;
	НоваяСвязь.ЭлементИсточник = Линия.connectFromItemId;
	НоваяСвязь.ГраньИсточника  = Линия.portIndexFrom;
	НоваяСвязь.ЭлементПриемник = Линия.connectToItemId;
	НоваяСвязь.ГраньПриемника  = 2;
	
КонецПроцедуры

// Выполняет построение линий связи в соответствии размещением элементов.
//
// Параметры:
//	ТаблицаСвязей - ТаблицаЗначений. Таблица связей элементов схемы: см. НоваяТаблицаСвязейЭлементовГрафическойСхемы().
//  ЭлементыПоИдентификаторам - Соответствие. Соответствие идентификторов ЭлементамXDTO.
//  ПараметрыРазмещения - Структура.
//
Процедура РазместитьЛинииСвязей(ТаблицаСвязей, ЭлементыПоИдентификаторам, ПараметрыРазмещения = Неопределено) Экспорт
	
	Если ПараметрыРазмещения = Неопределено Тогда
		ПараметрыРазмещения = НовыеПараметрыРазмещенияЭлементовСхемы();
	КонецЕсли;
	
	СтороныЭлементов = Новый ФиксированнаяСтруктура("Лево, Верх, Право, Низ", 1, 2, 3, 4);
	ДлинаЯчейки      = ПараметрыРазмещения.ВерхнееПоле;
	
	Для каждого СтрокаСвязи Из ТаблицаСвязей Цикл
		ЛинияXDTO    = ЭлементыПоИдентификаторам.Получить(СтрокаСвязи.ЛинияСвязи);
		ИсточникXDTO = ЭлементыПоИдентификаторам.Получить(СтрокаСвязи.ЭлементИсточник);
		ПриемникXDTO = ЭлементыПоИдентификаторам.Получить(СтрокаСвязи.ЭлементПриемник);
		ЛинияXDTO.point.Очистить();
		
		КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
		Если ПриемникXDTO = Неопределено Тогда
			КоординатыПрименика = НовыеКоординатыЭлементаXDTO();
			КоординатыПрименика.x = КоординатыИсточника.x;
			КоординатыПрименика.y = КоординатыИсточника.y + ДлинаЯчейки;
			КоординатыПрименика.Направление = "Низ";
		Иначе
			КоординатыПрименика = КоординатыГраниЭлементаXDTO(ПриемникXDTO, СтрокаСвязи.ГраньПриемника);
		КонецЕсли;
		
		Если КоординатыИсточника.x <> КоординатыПрименика.x
			И ТипЭлементаXDTOГрафическойСхемы(ИсточникXDTO) = Перечисления.бит_ЭлементыГрафическойСхемы.Условие Тогда
			// Оптимизируем расположение исходящих связей.
			ЛевоИсточника = ИсточникXDTO.rectLeft;
			ЛевоПриемника = ПриемникXDTO.rectLeft;
			Если ЛевоИсточника > ЛевоПриемника Тогда
				Если КоординатыИсточника.Направление <> "Лево" Тогда
					ЛинияXDTO.portIndexFrom    = СтороныЭлементов.Лево;
					СтрокаСвязи.ГраньИсточника = СтороныЭлементов.Лево;
					КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
				КонецЕсли;
			ИначеЕсли ЛевоИсточника = ЛевоПриемника Тогда
				Если КоординатыИсточника.Направление <> "Низ" Тогда
					ЛинияXDTO.portIndexFrom    = СтороныЭлементов.Низ;
					СтрокаСвязи.ГраньИсточника = СтороныЭлементов.Низ;
					КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
				КонецЕсли;
			Иначе
				Если КоординатыИсточника.Направление <> "Право" Тогда
					ЛинияXDTO.portIndexFrom    = СтороныЭлементов.Право;
					СтрокаСвязи.ГраньИсточника = СтороныЭлементов.Право;
					КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРазмещения.МенятьГраниСоединенияЛиний Тогда
			Если КоординатыИсточника.y > КоординатыПрименика.y Тогда
				// Цикл с возвратом. Пускаем исходящую стрелку справа.
				ЛинияXDTO.portIndexFrom    = СтороныЭлементов.Право;
				СтрокаСвязи.ГраньИсточника = СтороныЭлементов.Право;
				КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
			ИначеЕсли ЛинияПересекаетЭлементы(КоординатыИсточника, КоординатыПрименика, ЭлементыПоИдентификаторам,
												ПараметрыРазмещения) Тогда
				ЛинияXDTO.portIndexFrom    = СтороныЭлементов.Лево;
				СтрокаСвязи.ГраньИсточника = СтороныЭлементов.Лево;
				КоординатыИсточника = КоординатыГраниЭлементаXDTO(ИсточникXDTO, СтрокаСвязи.ГраньИсточника);
			КонецЕсли;
		КонецЕсли;
		
		ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(КоординатыИсточника));
		Если КоординатыИсточника.x <> КоординатыПрименика.x Тогда
			// Горизонтальное смещение.
			Если КоординатыИсточника.Направление = "Право" Тогда
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыИсточника.x + ДлинаЯчейки;
				ТочкаСдвига.y = КоординатыИсточника.y;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
				
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыИсточника.x + ДлинаЯчейки;
				ТочкаСдвига.y = ПриемникXDTO.rectTop - ДлинаЯчейки;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
				
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыПрименика.x;
				ТочкаСдвига.y = ПриемникXDTO.rectTop - ДлинаЯчейки;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
			ИначеЕсли КоординатыИсточника.Направление = "Лево" Тогда
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыИсточника.x - ДлинаЯчейки;
				ТочкаСдвига.y = КоординатыИсточника.y;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
				
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыИсточника.x - ДлинаЯчейки;
				Если Ложь Тогда
					ТочкаСдвига.y = ИсточникXDTO.rectBottom + ДлинаЯчейки;
				Иначе
					ТочкаСдвига.y = КоординатыПрименика.y - ДлинаЯчейки;
				КонецЕсли;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
				
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыПрименика.x;
				Если Ложь Тогда
					ТочкаСдвига.y = ИсточникXDTO.rectBottom + ДлинаЯчейки;
				Иначе
					ТочкаСдвига.y = КоординатыПрименика.y - ДлинаЯчейки;
				КонецЕсли;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
			Иначе
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыИсточника.x;
				ТочкаСдвига.y = КоординатыПрименика.y - ДлинаЯчейки;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
				
				ТочкаСдвига = НовыеКоординатыЭлементаXDTO();
				ТочкаСдвига.x = КоординатыПрименика.x;
				ТочкаСдвига.y = КоординатыПрименика.y - ДлинаЯчейки;
				ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(ТочкаСдвига));
			КонецЕсли;
		КонецЕсли;
		ЛинияXDTO.point.Добавить(НоваяТочкаXDTO(КоординатыПрименика));
	КонецЦикла;
	
КонецПроцедуры

// Выполняет полное перестроение графической схемы приводя размещение, размеры и точки связей к стандартам.
//
// Параметры:
//  ГрафическаяСхема - ГрафическаяСхема.
//	Структура - Параметры размещения элементов. Описание см в НовыеПараметрыРазмещенияЭлементовСхемы().
//
Процедура ОптимизироватьГрафическуюСхему(ГрафическаяСхема, ПараметрыРазмещения = Неопределено) Экспорт
	
	СхемаXDTO     = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	ЭлементыСхемы = СхемаXDTO.item;
	
	СвойстваЭлементов         = ОписаниеСвойствЭлементовСхемы(ЭлементыСхемы);
	ЭлементПервогоУровня      = СвойстваЭлементов.ТочкаСтарта;
	
	Если ЭлементПервогоУровня = Неопределено Тогда
		ЭлементПервогоУровня = ЭлементПервогоУровня(СвойстваЭлементов);
	КонецЕсли;

	МатрицаПозиций   = Новый Массив; // Массив массивов.
	АктивныеЭлементы = Новый Соответствие;
	
	Пока ЭлементПервогоУровня <> Неопределено Цикл
	    КолонкаМатрицы = Новый Массив;
		
		ЯчейкаВладалец = НоваяЯчейкаМатрицы();
		ЯчейкаВладалец.ЭлементСхемы = ЭлементПервогоУровня;
		бит_РаботаСКоллекциями.УдалитьЭлементМассиваПоЗначению(СвойстваЭлементов.ОбъемныеЭлементы, ЭлементПервогоУровня);
		ЯчейкаВладалец.Порядок      = 1;
		ПоместитьЯчейкуВМатрицу(ЯчейкаВладалец, КолонкаМатрицы, АктивныеЭлементы);
		МатрицаПозиций.Добавить(КолонкаМатрицы);
		ЗаполнитьЭлементыМатрицы(ЯчейкаВладалец, СвойстваЭлементов, МатрицаПозиций, КолонкаМатрицы, АктивныеЭлементы);
									
		ЭлементПервогоУровня = ЭлементПервогоУровня(СвойстваЭлементов);
	КонецЦикла;	
	
	РазместитьЭлементыМатрицыНаСхеме(МатрицаПозиций, СвойстваЭлементов.ЭлементыПоИдентификаторам, ПараметрыРазмещения);
	РазместитьЛинииСвязей(СвойстваЭлементов.ТаблицаСвязей, СвойстваЭлементов.ЭлементыПоИдентификаторам,
							ПараметрыРазмещения);
	
	ГрафическаяСхема = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецПроцедуры

// Производит анализ и выделение свойст элементов графической схемы.
//
// Параметры:
//	ЭлементыСхемы - СписокXDTO - Элементы графической схемы.
//
// Возвращаемое значение:
//  Структура.
//
Функция ОписаниеСвойствЭлементовСхемы(ЭлементыСхемы) Экспорт
	
	ТаблицаСвязей    = НоваяТаблицаСвязейЭлементовГрафическойСхемы();
	ТочкаСтарта      = Неопределено;
	ОбъемныеЭлементы = Новый Массив;
	
	ЭлементыПоИдентификаторам = Новый Соответствие;
	
	ЭлементыДляУдаления = Новый Массив;
	Для каждого СтрокаЭлемента Из ЭлементыСхемы Цикл
		ТипЭлемента           = ТипЭлементаXDTOГрафическойСхемы(СтрокаЭлемента);
		ИдентификаторЭлемента = СтрокаЭлемента.itemId;
		Если ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Линия Тогда
			ЭлементИсточник = СтрокаЭлемента.connectFromItemId;
			ЭлементПриемник = СтрокаЭлемента.connectToItemId;
			ГраньИсточника  = СтрокаЭлемента.portIndexFrom;
			Если ЭлементИсточник <= 0 Тогда
				// Линия без исходящей связи.
				ЭлементыДляУдаления.Добавить(СтрокаЭлемента.zOrder);
				Продолжить;
			КонецЕсли;
			Если ЭлементПриемник <> -1 Тогда
				ИсходящаяЛинияВыбораВарианта = Ложь;
				Для каждого СтрокаПроверяемогоЭлемента Из ЭлементыСхемы Цикл
					Если СтрокаПроверяемогоЭлемента.itemId = ЭлементИсточник Тогда
						ИсходящаяЛинияВыбораВарианта = 
							(ТипЭлементаXDTOГрафическойСхемы(СтрокаПроверяемогоЭлемента) =
								Перечисления.бит_ЭлементыГрафическойСхемы.ВыборВарианта);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Отбор = Новый Структура("ЭлементИсточник, ЭлементПриемник", ЭлементИсточник, ЭлементПриемник);
				Если ИсходящаяЛинияВыбораВарианта Тогда
					Отбор.Вставить("ГраньИсточника", ГраньИсточника);
				КонецЕсли;
				
				Если ТаблицаСвязей.НайтиСтроки(Отбор).Количество() > 0 Тогда
					// Дублирующиеся линии связи.
					ЭлементыДляУдаления.Добавить(СтрокаЭлемента.zOrder);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			НоваяЛинияСвязи = ТаблицаСвязей.Добавить();
			НоваяЛинияСвязи.ЛинияСвязи      = ИдентификаторЭлемента;
			НоваяЛинияСвязи.ЭлементИсточник = ЭлементИсточник;
			НоваяЛинияСвязи.ГраньИсточника  = ГраньИсточника;
			НоваяЛинияСвязи.ЭлементПриемник = ЭлементПриемник;
			Заголовки = СтрокаЭлемента.itemTitle.item;
			Если Заголовки.Количество() > 0 Тогда
				НоваяЛинияСвязи.Заголовок = Заголовки[0].content;
			КонецЕсли;
			
			Если ЭлементПриемник <> -1 Тогда
				// Приведем к стандартной нотификации блок схем - все входящие связи "сверху".
				НоваяЛинияСвязи.ГраньПриемника  = 2;
				СтрокаЭлемента.portIndexTo      = 2;
			КонецЕсли;
		Иначе
			ОбъемныеЭлементы.Добавить(ИдентификаторЭлемента);
			Если ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Старт Тогда
				ТочкаСтарта = ИдентификаторЭлемента;
			КонецЕсли;
		КонецЕсли;
		ЭлементыПоИдентификаторам.Вставить(ИдентификаторЭлемента, СтрокаЭлемента);
	КонецЦикла;
	Для Индекс = 1 - ЭлементыДляУдаления.Количество() По 0 Цикл
	    ИндексУдаляемогоЭлемента = ЭлементыДляУдаления.Получить(-Индекс);
	    ЭлементыСхемы.Удалить(ИндексУдаляемогоЭлемента);
	КонецЦикла;
	
	НаборСвойств = Новый Структура;
	НаборСвойств.Вставить("ТочкаСтарта",               ТочкаСтарта);
	НаборСвойств.Вставить("ТаблицаСвязей",             ТаблицаСвязей);
	НаборСвойств.Вставить("ЭлементыПоИдентификаторам", ЭлементыПоИдентификаторам);
	НаборСвойств.Вставить("ОбъемныеЭлементы",          ОбъемныеЭлементы);
	
	Возврат НаборСвойств;
	
КонецФункции

// Конструктор координат точки.
//
// Возвращаемое значение:
//  Структура.
//
Функция НовыеКоординатыЭлементаXDTO() Экспорт
	
	Координаты = Новый Структура;
	Координаты.Вставить("x");
	Координаты.Вставить("y");
	Координаты.Вставить("Направление");
	
	Возврат Координаты;
	
КонецФункции

// Создает новую точку XDTO по координатам.
//
// Параметры:
//	Координаты - См. НовыеКоординатыЭлементаXDTO() 
//
// Возвращаемое значение:
//  Структура.
//
Функция НоваяТочкаXDTO(Координаты) Экспорт
	
	ТочкаXDTO = СериализаторXDTO.Фабрика.Создать(
					СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.2/data/graphscheme","Point"));
	ТочкаXDTO.x = Координаты.x;
	ТочкаXDTO.y = Координаты.y;
	Возврат ТочкаXDTO;
	
КонецФункции

// Определяет тип элемента графической схемы.
//
// Параметры:
//  ЭлементСхемы - XDTO:KeyAndValue. Элемент схемы XDTO.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.бит_ЭлементыГрафическойСхемы.
//
Функция ТипЭлементаXDTOГрафическойСхемы(ЭлементСхемы) Экспорт
	
	ТипЭлемента = ЭлементСхемы.itemType;
	Если ТипЭлемента = 0 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Декорация;
	ИначеЕсли ТипЭлемента = 1 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Линия;
	ИначеЕсли ТипЭлемента = 2 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Старт;
	ИначеЕсли ТипЭлемента = 3 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Завершение;
	ИначеЕсли ТипЭлемента = 4 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Условие;
	ИначеЕсли ТипЭлемента = 5 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Действие;
	ИначеЕсли ТипЭлемента = 6 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.ВыборВарианта;
	ИначеЕсли ТипЭлемента = 7 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Разделение;
	ИначеЕсли ТипЭлемента = 8 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Слияние;
	ИначеЕсли ТипЭлемента = 9 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.Обработка;
	ИначеЕсли ТипЭлемента = 10 Тогда
		Возврат Перечисления.бит_ЭлементыГрафическойСхемы.ВложенныйПроцесс;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоординатыГраниЭлементаXDTO(ЭлементXDTO, НомерСтороны)
	
	Координаты = НовыеКоординатыЭлементаXDTO();
	Если НомерСтороны = 1 Тогда
		Координаты.x = ЭлементXDTO.rectLeft;
		Координаты.y = (ЭлементXDTO.rectTop + ЭлементXDTO.rectBottom) / 2;
		Координаты.Направление = "Лево";
	ИначеЕсли НомерСтороны = 2 Тогда
		Координаты.x = (ЭлементXDTO.rectLeft + ЭлементXDTO.rectRight) / 2;
		Координаты.y = ЭлементXDTO.rectTop;
		Координаты.Направление = "Верх";
	ИначеЕсли НомерСтороны = 3 Тогда
		Координаты.x = ЭлементXDTO.rectRight;
		Координаты.y = (ЭлементXDTO.rectTop + ЭлементXDTO.rectBottom) / 2;
		Координаты.Направление = "Право";
	ИначеЕсли ЭтоВыборВарианта(ЭлементXDTO) И НомерСтороны > 5 Тогда
		КоличествоВариантов   = ЭлементXDTO.transition.Количество();
		НомерТекущегоВарианта = Окр((НомерСтороны - 5) / 2);
		Координаты.x = ЭлементXDTO.rectRight;
		Координаты.y = ЭлементXDTO.rectBottom - 9 - (КоличествоВариантов - НомерТекущегоВарианта) * 18;
		Координаты.Направление = "Право";
	Иначе
		Координаты.x = (ЭлементXDTO.rectLeft + ЭлементXDTO.rectRight) / 2;
		Координаты.y = ЭлементXDTO.rectBottom;
		Координаты.Направление = "Низ";
	КонецЕсли;
	
	Возврат Координаты;
	
КонецФункции

Функция ЭтоВыборВарианта(ЭлементСхемы)
	
	ТипЭлемента = ЭлементСхемы.itemType;
	Возврат (ТипЭлемента = 6);
	
КонецФункции

Функция ЭлементПервогоУровня(СвойстваЭлементов)
	
	ЭлементыДляРазмещения = СвойстваЭлементов.ОбъемныеЭлементы;
	ТаблицаСвязей         = СвойстваЭлементов.ТаблицаСвязей;
	
	ЭлементПервогоУровня = Неопределено;
	
	Для каждого Идентификатор Из ЭлементыДляРазмещения Цикл 
		ЭлементПервогоУровня = Идентификатор;
		Если ТаблицаСвязей.Найти(Идентификатор, "ЭлементПриемник") = Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементПервогоУровня;
	
КонецФункции

Функция НоваяЯчейкаМатрицы()
	
	СтруктураЯчейки = Новый Структура;
	СтруктураЯчейки.Вставить("ЭлементСхемы");
	СтруктураЯчейки.Вставить("Порядок");
	СтруктураЯчейки.Вставить("Родители", Новый Массив);
	
	Возврат СтруктураЯчейки;
	
КонецФункции

Функция ПоместитьЯчейкуВМатрицу(Ячейка, НоваяКолонка, АктивныеЭлементы)
	
	ЭлементСхемы    = Ячейка.ЭлементСхемы;
	КолонкаЭлемента = АктивныеЭлементы.Получить(ЭлементСхемы);
	Если КолонкаЭлемента = Неопределено Тогда
		НоваяКолонка.Добавить(Ячейка);
		АктивныеЭлементы.Вставить(ЭлементСхемы, НоваяКолонка);
	Иначе // Текущий элемент уже размещен в матрице.
		
		Если ЭтоРекурсияЭлементовМатицы(Ячейка) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Проверим необходимость сдвига позиций для выравнивания.
		Для каждого ЭлементКолонки Из КолонкаЭлемента Цикл
			Если ЭлементКолонки.ЭлементСхемы <> ЭлементСхемы Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементКолонки.Порядок >= Ячейка.Порядок Тогда
				// Расположенный элемент уже имеет необходимый сдвиг позиции.
				Возврат Ложь;
			КонецЕсли;
			ЭлементКолонки.Порядок = Ячейка.Порядок;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоРекурсияЭлементовМатицы(Ячейка, ПроверяемыйЭлемент = Неопределено)
	
	Если ПроверяемыйЭлемент = Неопределено Тогда
		ПроверяемыйЭлемент = Ячейка.ЭлементСхемы;
	КонецЕсли;
	
	Для каждого Родитель Из Ячейка.Родители Цикл
		Если Родитель.ЭлементСхемы = ПроверяемыйЭлемент
			ИЛИ ЭтоРекурсияЭлементовМатицы(Родитель, ПроверяемыйЭлемент) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьЭлементыМатрицы(ЯчейкаВладалец, СвойстваЭлементов, МатрицаПозиций, ТекущаяКолонкаМатрицы, АктивныеЭлементы)
	
	Отбор                 = Новый Структура("ЭлементИсточник", ЯчейкаВладалец.ЭлементСхемы);
	СтрокиИсходящихСвязей = СвойстваЭлементов.ТаблицаСвязей.НайтиСтроки(Отбор);
	ПорядокСвязи          = 1;
	Для каждого СтрокаСвязи Из СтрокиИсходящихСвязей Цикл
		ЭлементПриемник = СтрокаСвязи.ЭлементПриемник;
		
		ЯчейкаНаследник = НоваяЯчейкаМатрицы();
		ЯчейкаНаследник.ЭлементСхемы = ЭлементПриемник;
		бит_РаботаСКоллекциями.УдалитьЭлементМассиваПоЗначению(СвойстваЭлементов.ОбъемныеЭлементы, ЭлементПриемник);
		ЯчейкаНаследник.Родители.Добавить(ЯчейкаВладалец);
		
		Если ПорядокСвязи = 1 Тогда
			// Первый элемент исходящей связи размещается в той же колонке.
			ЯчейкаНаследник.Порядок = ЯчейкаВладалец.Порядок + 1;
			Если ПоместитьЯчейкуВМатрицу(ЯчейкаНаследник, ТекущаяКолонкаМатрицы, АктивныеЭлементы) Тогда
				ЗаполнитьЭлементыМатрицы(ЯчейкаНаследник, СвойстваЭлементов, МатрицаПозиций, ТекущаяКолонкаМатрицы, АктивныеЭлементы);
			КонецЕсли;
		Иначе
			НоваяКолонкаМатрицы = Новый Массив;
			ЯчейкаНаследник.Порядок = ЯчейкаВладалец.Порядок + 1;
			Если ПоместитьЯчейкуВМатрицу(ЯчейкаНаследник, НоваяКолонкаМатрицы, АктивныеЭлементы) Тогда
				МатрицаПозиций.Добавить(НоваяКолонкаМатрицы);
				ЗаполнитьЭлементыМатрицы(ЯчейкаНаследник, СвойстваЭлементов, МатрицаПозиций, НоваяКолонкаМатрицы, АктивныеЭлементы);
			КонецЕсли;
		КонецЕсли;
		
		ПорядокСвязи = ПорядокСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура РазместитьЭлементыМатрицыНаСхеме(МатрицаПозиций, ЭлементыПоИдентификаторам, ПараметрыРазмещения = Неопределено)
	
	Если ПараметрыРазмещения = Неопределено Тогда 
		ПараметрыРазмещения = НовыеПараметрыРазмещенияЭлементовСхемы();
	КонецЕсли;
	
	// Для динамического расчета высоты элементов необходим первичных обход по строкам.
	// Выполним транспонированне матрицы элементов.
	ТранспонированнаяМатрица = Новый Массив;
	НомерКолонки = 1;
	Для каждого КолонкаМатрицы Из МатрицаПозиций Цикл
		Для каждого ЯчейкаМатицы Из КолонкаМатрицы Цикл
			НомерСтроки = ЯчейкаМатицы.Порядок;
			КолСтрок    = ТранспонированнаяМатрица.Количество();
			Если НомерСтроки > КолСтрок Тогда
				Для Сч = КолСтрок По НомерСтроки - 1 Цикл
					ТранспонированнаяМатрица.Добавить(Новый Массив);
				КонецЦикла;
			КонецЕсли;
			СтрокаМатицы = ТранспонированнаяМатрица[НомерСтроки - 1];
			
			КолКолонок = СтрокаМатицы.Количество();
			Если НомерКолонки > КолКолонок Тогда
				Для Сч = КолКолонок По НомерКолонки - 1 Цикл
					СтрокаМатицы.Добавить();
				КонецЦикла;
			КонецЕсли;
			СтрокаМатицы[НомерКолонки - 1] = ЯчейкаМатицы;
		КонецЦикла;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	НомерСтроки = 0;
	Для каждого СтрокаМатрицы Из ТранспонированнаяМатрица Цикл
		СмещениеРяда = 0;
		НомерСтроки  = НомерСтроки + 1;
		НомерКолонки = 0;
		Для каждого ЯчейкаМатицы Из СтрокаМатрицы Цикл
			НомерКолонки = НомерКолонки + 1;
			Если ЯчейкаМатицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТочкаXDTO = ЭлементыПоИдентификаторам.Получить(ЯчейкаМатицы.ЭлементСхемы);
			Если ТочкаXDTO = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ГраницыЭлемента = ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, НомерСтроки, НомерКолонки);
			
			Если ЭтоВыборВарианта(ТочкаXDTO) Тогда
				КоличествоВариантов = ТочкаXDTO.transition.Количество();
				Если КоличествоВариантов > 1 Тогда
					ВыделеннаяВысотаДляЭлементов = (КоличествоВариантов - 1) * 20;
					ГраницыЭлемента.rectBottom   = ГраницыЭлемента.rectBottom + ВыделеннаяВысотаДляЭлементов;
					
					СмещениеРяда = Макс(СмещениеРяда, ВыделеннаяВысотаДляЭлементов);
				КонецЕсли;
			КонецЕсли;
			
			РазместитьЭлементНаСхеме(ТочкаXDTO, ГраницыЭлемента, ПараметрыРазмещения);
		КонецЦикла;
		ПараметрыРазмещения.СмещениеВерхнихРядов = ПараметрыРазмещения.СмещениеВерхнихРядов + СмещениеРяда;
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйОбъектСтрокаXDTO(ТекстСтроки)
	
	ОбъектСтрока = СериализаторXDTO.Фабрика.Создать(
					СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.1/data/core","LocalStringType"));

	Если НЕ ПустаяСтрока(ТекстСтроки) Тогда
		ЭлементЛокализацииСтроки = СериализаторXDTO.Фабрика.Создать(
									СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.1/data/core","LocalStringItemType"));
		ЭлементЛокализацииСтроки.lang    = "#";
		ЭлементЛокализацииСтроки.content = ТекстСтроки;
		
		ОбъектСтрока.Item.Добавить(ЭлементЛокализацииСтроки);
	КонецЕсли;
	
	Возврат ОбъектСтрока;
	
КонецФункции

Функция ЛинияПересекаетЭлементы(КоординатыИсточника, КоординатыПрименика, ЭлементыПоИдентификаторам, ПараметрыРазмещения)
	
	Если НЕ ПараметрыРазмещения.ПроверятьПересечениеЛинийСЭлементами Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачалоВертикали    = КоординатыИсточника.y + ПараметрыРазмещения.ВысотаЭлемента;
	ОкончаниеВертикали = КоординатыПрименика.y;
	
	Для каждого ЭлементСоответствия Из ЭлементыПоИдентификаторам Цикл
		ЭлементСхемы = ЭлементСоответствия.Значение;
		ТипЭлемента  = ТипЭлементаXDTOГрафическойСхемы(ЭлементСхемы);
		Если ТипЭлемента = Перечисления.бит_ЭлементыГрафическойСхемы.Линия Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементСхемы.rectLeft > КоординатыИсточника.x
			ИЛИ ЭлементСхемы.rectRight < КоординатыИсточника.x
			ИЛИ ЭлементСхемы.rectTop < НачалоВертикали 
			ИЛИ ЭлементСхемы.rectBottom > ОкончаниеВертикали Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;	
	КонецЦикла;
		
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
